cmsis-svd/cmsis-svd/data/NXP/MKE14Z4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <description>Cyclic Redundancy Check</description>
      <groupName>CRC</groupName>
      <prependToName>CRC_</prependToName>
      <baseAddress>0x40032000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DATA</name>
          <description>CRC Data register</description>
          <alternateGroup>DATA_DATAL_DATALL</alternateGroup>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LL</name>
              <description>CRC Low Lower Byte</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LU</name>
              <description>CRC Low Upper Byte</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HL</name>
              <description>CRC High Lower Byte</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HU</name>
              <description>CRC High Upper Byte</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAL</name>
          <description>CRC_DATAL register.</description>
          <alternateGroup>DATA_DATAL_DATALL</alternateGroup>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DATAL</name>
              <description>DATAL stores the lower 16 bits of the 16/32 bit CRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATALL</name>
          <description>CRC_DATALL register.</description>
          <alternateGroup>DATA_DATAL_DATALL</alternateGroup>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DATALL</name>
              <description>CRCLL stores the first 8 bits of the 32 bit DATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATALU</name>
          <description>CRC_DATALU register.</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DATALU</name>
              <description>DATALL stores the second 8 bits of the 32 bit CRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAH</name>
          <description>CRC_DATAH register.</description>
          <alternateGroup>DATAH_DATAHL</alternateGroup>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DATAH</name>
              <description>DATAH stores the high 16 bits of the 16/32 bit CRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAHL</name>
          <description>CRC_DATAHL register.</description>
          <alternateGroup>DATAH_DATAHL</alternateGroup>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DATAHL</name>
              <description>DATAHL stores the third 8 bits of the 32 bit CRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAHU</name>
          <description>CRC_DATAHU register.</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DATAHU</name>
              <description>DATAHU stores the fourth 8 bits of the 32 bit CRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPOLY</name>
          <description>CRC Polynomial register</description>
          <alternateGroup>GPOLY_GPOLYL_GPOLYLL</alternateGroup>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1021</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOW</name>
              <description>Low Polynominal Half-word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIGH</name>
              <description>High Polynominal Half-word</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPOLYL</name>
          <description>CRC_GPOLYL register.</description>
          <alternateGroup>GPOLY_GPOLYL_GPOLYLL</alternateGroup>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>GPOLYL</name>
              <description>POLYL stores the lower 16 bits of the 16/32 bit CRC polynomial value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPOLYLL</name>
          <description>CRC_GPOLYLL register.</description>
          <alternateGroup>GPOLY_GPOLYL_GPOLYLL</alternateGroup>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GPOLYLL</name>
              <description>POLYLL stores the first 8 bits of the 32 bit CRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPOLYLU</name>
          <description>CRC_GPOLYLU register.</description>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GPOLYLU</name>
              <description>POLYLL stores the second 8 bits of the 32 bit CRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPOLYH</name>
          <description>CRC_GPOLYH register.</description>
          <alternateGroup>GPOLYH_GPOLYHL</alternateGroup>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>GPOLYH</name>
              <description>POLYH stores the high 16 bits of the 16/32 bit CRC polynomial value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPOLYHL</name>
          <description>CRC_GPOLYHL register.</description>
          <alternateGroup>GPOLYH_GPOLYHL</alternateGroup>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GPOLYHL</name>
              <description>POLYHL stores the third 8 bits of the 32 bit CRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPOLYHU</name>
          <description>CRC_GPOLYHU register.</description>
          <addressOffset>0x7</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>GPOLYHU</name>
              <description>POLYHU stores the fourth 8 bits of the 32 bit CRC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>CRC Control register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TCRC</name>
              <description>Width of CRC protocol.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCRC_0</name>
                  <description>16-bit CRC protocol.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCRC_1</name>
                  <description>32-bit CRC protocol.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAS</name>
              <description>Write CRC Data Register As Seed</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAS_0</name>
                  <description>Writes to the CRC data register are data values.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAS_1</name>
                  <description>Writes to the CRC data register are seed values.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FXOR</name>
              <description>Complement Read Of CRC Data Register</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FXOR_0</name>
                  <description>No XOR on reading.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FXOR_1</name>
                  <description>Invert or complement the read value of the CRC Data register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOTR</name>
              <description>Type Of Transpose For Read</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TOTR_0</name>
                  <description>No transposition.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOTR_1</name>
                  <description>Bits in bytes are transposed; bytes are not transposed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOTR_2</name>
                  <description>Both bits in bytes and bytes are transposed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOTR_3</name>
                  <description>Only bytes are transposed; no bits in a byte are transposed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOT</name>
              <description>Type Of Transpose For Writes</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TOT_0</name>
                  <description>No transposition.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOT_1</name>
                  <description>Bits in bytes are transposed; bytes are not transposed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOT_2</name>
                  <description>Both bits in bytes and bytes are transposed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOT_3</name>
                  <description>Only bytes are transposed; no bits in a byte are transposed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLHU</name>
          <description>CRC_CTRLHU register.</description>
          <addressOffset>0xB</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>TCRC</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCRC_0</name>
                  <description>16-bit CRC protocol.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCRC_1</name>
                  <description>32-bit CRC protocol.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAS</name>
              <description>no description available</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAS_0</name>
                  <description>Writes to CRC data register are data values.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAS_1</name>
                  <description>Writes to CRC data reguster are seed values.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FXOR</name>
              <description>no description available</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FXOR_0</name>
                  <description>No XOR on reading.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FXOR_1</name>
                  <description>Invert or complement the read value of CRC data register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOTR</name>
              <description>no description available</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TOTR_0</name>
                  <description>No Transposition.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOTR_1</name>
                  <description>Bits in bytes are transposed, bytes are not transposed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOTR_2</name>
                  <description>Both bits in bytes and bytes are transposed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOTR_3</name>
                  <description>Only bytes are transposed; no bits in a byte are transposed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOT</name>
              <description>no description available</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TOT_0</name>
                  <description>No Transposition.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOT_1</name>
                  <description>Bits in bytes are transposed, bytes are not transposed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOT_2</name>
                  <description>Both bits in bytes and bytes are transposed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOT_3</name>
                  <description>Only bytes are transposed; no bits in a byte are transposed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
