cmsis-svd/cmsis-svd/data/NXP/MKE14Z4.svd
              <name>PDD25</name>
              <description>Port Data Direction</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDD_0</name>
                  <description>Pin is configured as general-purpose input, for the GPIO function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDD_1</name>
                  <description>Pin is configured as general-purpose output, for the GPIO function.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDD26</name>
              <description>Port Data Direction</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDD_0</name>
                  <description>Pin is configured as general-purpose input, for the GPIO function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDD_1</name>
                  <description>Pin is configured as general-purpose output, for the GPIO function.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDD27</name>
              <description>Port Data Direction</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDD_0</name>
                  <description>Pin is configured as general-purpose input, for the GPIO function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDD_1</name>
                  <description>Pin is configured as general-purpose output, for the GPIO function.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDD28</name>
              <description>Port Data Direction</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDD_0</name>
                  <description>Pin is configured as general-purpose input, for the GPIO function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDD_1</name>
                  <description>Pin is configured as general-purpose output, for the GPIO function.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDD29</name>
              <description>Port Data Direction</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDD_0</name>
                  <description>Pin is configured as general-purpose input, for the GPIO function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDD_1</name>
                  <description>Pin is configured as general-purpose output, for the GPIO function.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDD30</name>
              <description>Port Data Direction</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDD_0</name>
                  <description>Pin is configured as general-purpose input, for the GPIO function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDD_1</name>
                  <description>Pin is configured as general-purpose output, for the GPIO function.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDD31</name>
              <description>Port Data Direction</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDD_0</name>
                  <description>Pin is configured as general-purpose input, for the GPIO function.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDD_1</name>
                  <description>Pin is configured as general-purpose output, for the GPIO function.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
